# 系统监控
brew "btop"
brew "htop"

# 文件与搜索
brew "bat"
brew "fzf"
brew "lsd"
brew "eza"
brew "ripgrep"
brew "zoxide"
brew "vivid"

# 开发环境
brew "nvm"
brew "nginx"
brew "tmux"

# Shell 增强
brew "zsh"
brew "thefuck"
brew "starship"

# 帮助文档
brew "tldr"

# 实用工具
brew "navi"
brew "trash"
brew "neofetch"
brew "stow"

# 其他
brew "wails"

# 终端模拟器
cask "ghostty"
cask "iterm2"

# 容器与虚拟化
cask "orbstack"
